content/emacs/configs/programming/05-lua.org
#+TITLE: Lua Programming Configuration
#+AUTHOR: Kyeong Soo Choi
#+DATE: 2025-12-01
#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/elisp/settings/prog-lua-conf.el :mkdirp yes :results no

* Lua Development Environment

Configuration for Lua programming, including syntax highlighting, LSP support, and REPL integration.

* Lua Mode

Core Lua editing mode with syntax highlighting and indentation.

#+begin_src emacs-lisp
  ;;; prog-lua-conf.el --- Lua programming configuration  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Lua development environment setup including LSP and REPL support
  ;;; Code:

  (use-package lua-mode
    :ensure t
    :mode "\\.lua\\'"
    :interpreter "lua"
    :custom
    ;; Indentation settings
    (lua-indent-level 2)
    (lua-indent-string-contents t)
    (lua-indent-nested-block-content-align nil)
    (lua-indent-close-paren-align nil)
    
    ;; Documentation lookup
    (lua-documentation-url "https://www.lua.org/manual/5.4/")
    
    ;; :config
    ;; Set up company completion for Lua
    ;; (add-hook 'lua-mode-hook
    ;;           (lambda ()
    ;;             (setq-local company-backends
    ;;                         '((company-lsp
    ;;                            company-lua
    ;;                            company-keywords
    ;;                            company-gtags
    ;;                            company-yasnippet
    ;;                            company-files)))))
    
    ;; Enable electric pair mode for automatic bracket pairing
    ;; (add-hook 'lua-mode-hook #'electric-pair-local-mode)
    
    ;; Enable show-paren-mode for matching parentheses
    ;; (add-hook 'lua-mode-hook #'show-paren-mode)
    
    ;; Enable line numbers
    ;; (add-hook 'lua-mode-hook #'display-line-numbers-mode)
    
    ;; :bind
    ;; (:map lua-mode-map
    ;;       ("C-c C-d" . lua-search-documentation)
    ;;       ("C-c C-r" . lua-send-region)
    ;;       ("C-c C-l" . lua-send-buffer)
    ;;       ("C-c C-c" . lua-send-current-line))
    )
#+end_src

#+RESULTS:
: ((lua . lua-mode) (python3 . python) (python . python) (node . js2-mode) (nbb . clojurescript-mode) (bb . clojure-mode) (j?ruby\(?:[0-9.]+\) . ruby-mode) (jruby . ruby-mode) (rbx . ruby-mode) (ruby . ruby-mode) (python[0-9.]* . python-mode) (rhino . js-mode) (gjs . js-mode) (nodejs . js-mode) (node . js-mode) (gawk . awk-mode) (nawk . awk-mode) (mawk . awk-mode) (awk . awk-mode) (pike . pike-mode) (\(mini\)?perl5? . perl-mode) (wishx? . tcl-mode) (tcl\(sh\)? . tcl-mode) (expect . tcl-mode) (octave . octave-mode) (scm . scheme-mode) ([acjkwz]sh . sh-mode) (r?bash2? . sh-mode) (dash . sh-mode) (mksh . sh-mode) (\(dt\|pd\|w\)ksh . sh-mode) (es . sh-mode) (i?tcsh . sh-mode) (oash . sh-mode) (rc . sh-mode) (rpm . sh-mode) (sh5? . sh-mode) (tail . text-mode) (more . text-mode) (less . text-mode) (pg . text-mode) (make . makefile-gmake-mode) (guile . scheme-mode) (clisp . lisp-mode) (emacs . emacs-lisp-mode))

* LSP Support for Lua

Configure Language Server Protocol support using lua-language-server (sumneko_lua).

#+begin_src emacs-lisp :tangle no
(use-package lsp-mode
  :hook (lua-mode . lsp-deferred)
  :custom
  ;; Lua LSP specific settings
  (lsp-lua-runtime-version "Lua 5.4")
  (lsp-lua-diagnostics-globals '("vim" "awesome" "love"))  ; Add global variables to ignore
  (lsp-lua-workspace-library
   '("/usr/share/awesome/lib"  ; For AwesomeWM development
     "/usr/share/lua/5.4"))     ; System Lua libraries
  (lsp-lua-completion-call-snippet "Replace")
  (lsp-lua-telemetry-enable nil)  ; Disable telemetry
  
  :config
  ;; Register lua-language-server if not already registered
  (unless (member 'lua-language-server (mapcar #'car lsp-clients))
    (lsp-register-client
     (make-lsp-client
      :new-connection (lsp-stdio-connection "lua-language-server")
      :major-modes '(lua-mode)
      :server-id 'lua-language-server
      :priority 1))))
#+end_src

