emacs/configs/programming/05-lua.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lua Programming Configuration</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="prose prose-zinc dark:prose-invert mx-auto w-full max-w-xl md:max-w-xl lg:max-w-2xl xl:max-w-3xl px-4 sm:px-6 lg:px-8">
<h1 class="title">Lua Programming Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga4cdc99">1. Lua Development Environment</a></li>
<li><a href="#org9a5fafe">2. Lua Mode</a></li>
<li><a href="#orgb784d44">3. LSP Support for Lua</a></li>
<li><a href="#org1037ece">4. Lua REPL Integration</a></li>
<li><a href="#orgd4d44ba">5. Love2D Support (Optional)</a></li>
<li><a href="#org1f6c503">6. Debugging Support</a></li>
<li><a href="#orgeabf3b0">7. Code Formatting</a></li>
<li><a href="#orgb8ee5fe">8. Project Templates</a></li>
<li><a href="#orgdfd0d16">9. Keybindings Summary</a></li>
<li><a href="#org14c8b10">10. Installation Requirements</a></li>
<li><a href="#orgb03989f">11. End of Configuration</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga4cdc99" class="outline-2">
<h2 id="orga4cdc99"><span class="section-number-2">1.</span> Lua Development Environment</h2>
<div class="outline-text-2" id="text-1">
<p>
Configuration for Lua programming, including syntax highlighting, LSP support, and REPL integration.
</p>
</div>
</div>

<div id="outline-container-org9a5fafe" class="outline-2">
<h2 id="org9a5fafe"><span class="section-number-2">2.</span> Lua Mode</h2>
<div class="outline-text-2" id="text-2">
<p>
Core Lua editing mode with syntax highlighting and indentation.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">prog-lua-conf.el --- Lua programming configuration  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Lua development environment setup including LSP and REPL support
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>
(<span class="org-keyword">use-package</span> lua-mode
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> <span class="org-string">"\\.lua\\'"</span>
  <span class="org-builtin">:interpreter</span> <span class="org-string">"lua"</span>
  <span class="org-builtin">:custom</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Indentation settings
</span>  (lua-indent-level 2)
  (lua-indent-string-contents t)
  (lua-indent-nested-block-content-align nil)
  (lua-indent-close-paren-align nil)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Documentation lookup
</span>  (lua-documentation-url <span class="org-string">"https://www.lua.org/manual/5.4/"</span>)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">:config
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">Set up company completion for Lua
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(add-hook 'lua-mode-hook
</span>  <span class="org-comment-delimiter">;;           </span><span class="org-comment">(lambda ()
</span>  <span class="org-comment-delimiter">;;             </span><span class="org-comment">(setq-local company-backends
</span>  <span class="org-comment-delimiter">;;                         </span><span class="org-comment">'((company-lsp
</span>  <span class="org-comment-delimiter">;;                            </span><span class="org-comment">company-lua
</span>  <span class="org-comment-delimiter">;;                            </span><span class="org-comment">company-keywords
</span>  <span class="org-comment-delimiter">;;                            </span><span class="org-comment">company-gtags
</span>  <span class="org-comment-delimiter">;;                            </span><span class="org-comment">company-yasnippet
</span>  <span class="org-comment-delimiter">;;                            </span><span class="org-comment">company-files)))))
</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Enable electric pair mode for automatic bracket pairing
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(add-hook 'lua-mode-hook #'electric-pair-local-mode)
</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Enable show-paren-mode for matching parentheses
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(add-hook 'lua-mode-hook #'show-paren-mode)
</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Enable line numbers
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(add-hook 'lua-mode-hook #'display-line-numbers-mode)
</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">:bind
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(:map lua-mode-map
</span>  <span class="org-comment-delimiter">;;       </span><span class="org-comment">("C-c C-d" . lua-search-documentation)
</span>  <span class="org-comment-delimiter">;;       </span><span class="org-comment">("C-c C-r" . lua-send-region)
</span>  <span class="org-comment-delimiter">;;       </span><span class="org-comment">("C-c C-l" . lua-send-buffer)
</span>  <span class="org-comment-delimiter">;;       </span><span class="org-comment">("C-c C-c" . lua-send-current-line))
</span>  )
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb784d44" class="outline-2">
<h2 id="orgb784d44"><span class="section-number-2">3.</span> LSP Support for Lua</h2>
<div class="outline-text-2" id="text-3">
<p>
Configure Language Server Protocol support using lua-language-server (sumneko<sub>lua</sub>).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> lsp-mode
  <span class="org-builtin">:hook</span> (lua-mode . lsp-deferred)
  <span class="org-builtin">:custom</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Lua LSP specific settings
</span>  (lsp-lua-runtime-version <span class="org-string">"Lua 5.4"</span>)
  (lsp-lua-diagnostics-globals '(<span class="org-string">"vim"</span> <span class="org-string">"awesome"</span> <span class="org-string">"love"</span>))  <span class="org-comment-delimiter">; </span><span class="org-comment">Add global variables to ignore
</span>  (lsp-lua-workspace-library
   '(<span class="org-string">"/usr/share/awesome/lib"</span>  <span class="org-comment-delimiter">; </span><span class="org-comment">For AwesomeWM development
</span>     <span class="org-string">"/usr/share/lua/5.4"</span>))     <span class="org-comment-delimiter">; </span><span class="org-comment">System Lua libraries
</span>  (lsp-lua-completion-call-snippet <span class="org-string">"Replace"</span>)
  (lsp-lua-telemetry-enable nil)  <span class="org-comment-delimiter">; </span><span class="org-comment">Disable telemetry
</span>
  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Register lua-language-server if not already registered
</span>  (<span class="org-keyword">unless</span> (member 'lua-language-server (mapcar #'car lsp-clients))
    (lsp-register-client
     (make-lsp-client
      <span class="org-builtin">:new-connection</span> (lsp-stdio-connection <span class="org-string">"lua-language-server"</span>)
      <span class="org-builtin">:major-modes</span> '(lua-mode)
      <span class="org-builtin">:server-id</span> 'lua-language-server
      <span class="org-builtin">:priority</span> 1))))
</pre>
</div>
</div>
</div>
