content/emacs/configs/programming/05-lua.org
* Lua REPL Integration

Interactive Lua development with inferior Lua process.

#+begin_src emacs-lisp :tangle no
(use-package lua-mode
  :custom
  ;; Configure Lua interpreter
  (lua-default-application "lua")
  
  ;; For LuaJIT
  ;; (lua-default-application "luajit")
  
  ;; Custom Lua interpreter with arguments
  ;; (lua-default-application '("lua" "-i" "-e" "_PROMPT='> '"))
  
  :config
  ;; Function to start Lua REPL in a split window
  (defun my/lua-start-repl ()
    "Start Lua REPL in a split window."
    (interactive)
    (if (get-buffer lua-process-buffer)
        (switch-to-buffer-other-window lua-process-buffer)
      (progn
        (split-window-below)
        (other-window 1)
        (lua-start-process))))
  
  ;; Function to send current function to REPL
  (defun my/lua-send-function ()
    "Send the current function to Lua REPL."
    (interactive)
    (save-excursion
      (lua-beginning-of-proc)
      (let ((start (point)))
        (lua-end-of-proc)
        (lua-send-region start (point)))))
  
  :bind
  (:map lua-mode-map
        ("C-c C-z" . my/lua-start-repl)
        ("C-c C-f" . my/lua-send-function)))
#+end_src

* Love2D Support (Optional)

Configuration for Love2D game development framework.

#+begin_src emacs-lisp :tangle no
;; Only load if doing Love2D development
(when (executable-find "love")
  (use-package love-minor-mode
    :ensure t
    :hook (lua-mode . love-minor-mode)
    :custom
    (love-exe "love")  ; Path to Love2D executable
    :config
    ;; Add Love2D API to LSP globals
    (when (featurep 'lsp-mode)
      (add-to-list 'lsp-lua-diagnostics-globals "love"))))
#+end_src

* Debugging Support

Configure debugging support for Lua using DAP (Debug Adapter Protocol).

#+begin_src emacs-lisp :tangle no
(use-package dap-mode
  :after lua-mode
  :config
  ;; Lua debugging configuration
  (require 'dap-lua)
  
  ;; Local Lua debugging template
  (dap-register-debug-template
   "Lua Run"
   (list :type "lua"
         :request "launch"
         :name "Lua Run"
         :program (lambda () (buffer-file-name))
         :cwd (lambda () (project-root (project-current)))))
  
  ;; Love2D debugging template
  (dap-register-debug-template
   "Love2D Run"
   (list :type "lua"
         :request "launch"
         :name "Love2D Run"
         :program "love"
         :args (lambda () (list (project-root (project-current))))
         :cwd (lambda () (project-root (project-current))))))
#+end_src

* Code Formatting

Setup automatic code formatting using lua-fmt or stylua.

#+begin_src emacs-lisp :tangle no
;; Use stylua if available (recommended)
(when (executable-find "stylua")
  (use-package reformatter
    :ensure t
    :config
    ;; Define stylua formatter
    (reformatter-define lua-stylua
      :program "stylua"
      :args '("-")
      :lighter " StyLua")
    
    ;; Enable on save
    (add-hook 'lua-mode-hook #'lua-stylua-on-save-mode)
    
    ;; Bind to key
    (define-key lua-mode-map (kbd "C-c C-f") #'lua-stylua-buffer)))

;; Alternative: lua-fmt (if stylua not available)
(unless (executable-find "stylua")
  (when (executable-find "lua-fmt")
    (use-package reformatter
      :ensure t
      :config
      (reformatter-define lua-fmt
        :program "lua-fmt"
        :args '()
        :lighter " LuaFmt")
      
      (add-hook 'lua-mode-hook #'lua-fmt-on-save-mode)
      (define-key lua-mode-map (kbd "C-c C-f") #'lua-fmt-buffer))))
#+end_src

* Project Templates

Snippets and templates for common Lua patterns.

#+begin_src emacs-lisp :tangle no
(use-package yasnippet
  :hook (lua-mode . yas-minor-mode)
  :config
  ;; Define some useful Lua snippets
  (yas-define-snippets
   'lua-mode
   '(;; Function definition
     ("fn" "function ${1:name}(${2:args})\n    $0\nend" "function")
     
     ;; Local function
     ("lfn" "local function ${1:name}(${2:args})\n    $0\nend" "local function")
     
     ;; Module definition
     ("mod" "local M = {}\n\n$0\n\nreturn M" "module")
     
     ;; Class definition (OOP style)
     ("class" "local ${1:Class} = {}\n${1:$(capitalize yas-text)}.mt = { __index = ${1:$(capitalize yas-text)} }\n\nfunction ${1:$(capitalize yas-text)}.new(${2:args})\n    local self = setmetatable({}, ${1:$(capitalize yas-text)}.mt)\n    $0\n    return self\nend\n\nreturn ${1:$(capitalize yas-text)}" "class")
     
     ;; For loop
     ("for" "for ${1:i} = ${2:1}, ${3:10} do\n    $0\nend" "for loop")
     
     ;; For in loop
     ("fori" "for ${1:k}, ${2:v} in ${3:pairs}(${4:table}) do\n    $0\nend" "for in loop")
     
     ;; Require
     ("req" "local ${1:module} = require('${2:module}')" "require"))))
#+end_src

