emacs/configs/programming/05-lua.html

<div id="outline-container-org1037ece" class="outline-2">
<h2 id="org1037ece"><span class="section-number-2">4.</span> Lua REPL Integration</h2>
<div class="outline-text-2" id="text-4">
<p>
Interactive Lua development with inferior Lua process.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> lua-mode
  <span class="org-builtin">:custom</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Configure Lua interpreter
</span>  (lua-default-application <span class="org-string">"lua"</span>)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">For LuaJIT
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(lua-default-application "luajit")
</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Custom Lua interpreter with arguments
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(lua-default-application '("lua" "-i" "-e" "_PROMPT='&gt; '"))
</span>
  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Function to start Lua REPL in a split window
</span>  (<span class="org-keyword">defun</span> <span class="org-function-name">my/lua-start-repl</span> ()
    <span class="org-doc">"Start Lua REPL in a split window."</span>
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">if</span> (get-buffer lua-process-buffer)
        (switch-to-buffer-other-window lua-process-buffer)
      (<span class="org-keyword">progn</span>
        (split-window-below)
        (other-window 1)
        (lua-start-process))))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Function to send current function to REPL
</span>  (<span class="org-keyword">defun</span> <span class="org-function-name">my/lua-send-function</span> ()
    <span class="org-doc">"Send the current function to Lua REPL."</span>
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">save-excursion</span>
      (lua-beginning-of-proc)
      (<span class="org-keyword">let</span> ((start (point)))
        (lua-end-of-proc)
        (lua-send-region start (point)))))

  <span class="org-builtin">:bind</span>
  (<span class="org-builtin">:map</span> lua-mode-map
        (<span class="org-string">"C-c C-z"</span> . my/lua-start-repl)
        (<span class="org-string">"C-c C-f"</span> . my/lua-send-function)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd4d44ba" class="outline-2">
<h2 id="orgd4d44ba"><span class="section-number-2">5.</span> Love2D Support (Optional)</h2>
<div class="outline-text-2" id="text-5">
<p>
Configuration for Love2D game development framework.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Only load if doing Love2D development
</span>(<span class="org-keyword">when</span> (executable-find <span class="org-string">"love"</span>)
  (<span class="org-keyword">use-package</span> love-minor-mode
    <span class="org-builtin">:ensure</span> t
    <span class="org-builtin">:hook</span> (lua-mode . love-minor-mode)
    <span class="org-builtin">:custom</span>
    (love-exe <span class="org-string">"love"</span>)  <span class="org-comment-delimiter">; </span><span class="org-comment">Path to Love2D executable
</span>    <span class="org-builtin">:config</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Add Love2D API to LSP globals
</span>    (<span class="org-keyword">when</span> (<span class="org-keyword">featurep</span> '<span class="org-constant">lsp-mode</span>)
      (add-to-list 'lsp-lua-diagnostics-globals <span class="org-string">"love"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f6c503" class="outline-2">
<h2 id="org1f6c503"><span class="section-number-2">6.</span> Debugging Support</h2>
<div class="outline-text-2" id="text-6">
<p>
Configure debugging support for Lua using DAP (Debug Adapter Protocol).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> dap-mode
  <span class="org-builtin">:after</span> lua-mode
  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Lua debugging configuration
</span>  (<span class="org-keyword">require</span> '<span class="org-constant">dap-lua</span>)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Local Lua debugging template
</span>  (dap-register-debug-template
   <span class="org-string">"Lua Run"</span>
   (list <span class="org-builtin">:type</span> <span class="org-string">"lua"</span>
         <span class="org-builtin">:request</span> <span class="org-string">"launch"</span>
         <span class="org-builtin">:name</span> <span class="org-string">"Lua Run"</span>
         <span class="org-builtin">:program</span> (<span class="org-keyword">lambda</span> () (buffer-file-name))
         <span class="org-builtin">:cwd</span> (<span class="org-keyword">lambda</span> () (project-root (project-current)))))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Love2D debugging template
</span>  (dap-register-debug-template
   <span class="org-string">"Love2D Run"</span>
   (list <span class="org-builtin">:type</span> <span class="org-string">"lua"</span>
         <span class="org-builtin">:request</span> <span class="org-string">"launch"</span>
         <span class="org-builtin">:name</span> <span class="org-string">"Love2D Run"</span>
         <span class="org-builtin">:program</span> <span class="org-string">"love"</span>
         <span class="org-builtin">:args</span> (<span class="org-keyword">lambda</span> () (list (project-root (project-current))))
         <span class="org-builtin">:cwd</span> (<span class="org-keyword">lambda</span> () (project-root (project-current))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeabf3b0" class="outline-2">
<h2 id="orgeabf3b0"><span class="section-number-2">7.</span> Code Formatting</h2>
<div class="outline-text-2" id="text-7">
<p>
Setup automatic code formatting using lua-fmt or stylua.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Use stylua if available (recommended)
</span>(<span class="org-keyword">when</span> (executable-find <span class="org-string">"stylua"</span>)
  (<span class="org-keyword">use-package</span> reformatter
    <span class="org-builtin">:ensure</span> t
    <span class="org-builtin">:config</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Define stylua formatter
</span>    (reformatter-define lua-stylua
      <span class="org-builtin">:program</span> <span class="org-string">"stylua"</span>
      <span class="org-builtin">:args</span> '(<span class="org-string">"-"</span>)
      <span class="org-builtin">:lighter</span> <span class="org-string">" StyLua"</span>)

    <span class="org-comment-delimiter">;; </span><span class="org-comment">Enable on save
</span>    (add-hook 'lua-mode-hook #'lua-stylua-on-save-mode)

    <span class="org-comment-delimiter">;; </span><span class="org-comment">Bind to key
</span>    (define-key lua-mode-map (kbd <span class="org-string">"C-c C-f"</span>) #'lua-stylua-buffer)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Alternative: lua-fmt (if stylua not available)
</span>(<span class="org-keyword">unless</span> (executable-find <span class="org-string">"stylua"</span>)
  (<span class="org-keyword">when</span> (executable-find <span class="org-string">"lua-fmt"</span>)
    (<span class="org-keyword">use-package</span> reformatter
      <span class="org-builtin">:ensure</span> t
      <span class="org-builtin">:config</span>
      (reformatter-define lua-fmt
        <span class="org-builtin">:program</span> <span class="org-string">"lua-fmt"</span>
        <span class="org-builtin">:args</span> '()
        <span class="org-builtin">:lighter</span> <span class="org-string">" LuaFmt"</span>)

      (add-hook 'lua-mode-hook #'lua-fmt-on-save-mode)
      (define-key lua-mode-map (kbd <span class="org-string">"C-c C-f"</span>) #'lua-fmt-buffer))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb8ee5fe" class="outline-2">
<h2 id="orgb8ee5fe"><span class="section-number-2">8.</span> Project Templates</h2>
<div class="outline-text-2" id="text-8">
<p>
Snippets and templates for common Lua patterns.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> yasnippet
  <span class="org-builtin">:hook</span> (lua-mode . yas-minor-mode)
  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Define some useful Lua snippets
</span>  (yas-define-snippets
   'lua-mode
   '(<span class="org-comment-delimiter">;; </span><span class="org-comment">Function definition
</span>     (<span class="org-string">"fn"</span> <span class="org-string">"function ${1:name}(${2:args})\n    $0\nend"</span> <span class="org-string">"function"</span>)

     <span class="org-comment-delimiter">;; </span><span class="org-comment">Local function
</span>     (<span class="org-string">"lfn"</span> <span class="org-string">"local function ${1:name}(${2:args})\n    $0\nend"</span> <span class="org-string">"local function"</span>)

     <span class="org-comment-delimiter">;; </span><span class="org-comment">Module definition
</span>     (<span class="org-string">"mod"</span> <span class="org-string">"local M = {}\n\n$0\n\nreturn M"</span> <span class="org-string">"module"</span>)

     <span class="org-comment-delimiter">;; </span><span class="org-comment">Class definition (OOP style)
</span>     (<span class="org-string">"class"</span> <span class="org-string">"local ${1:Class} = {}\n${1:$(capitalize yas-text)}.mt = { __index = ${1:$(capitalize yas-text)} }\n\nfunction ${1:$(capitalize yas-text)}.new(${2:args})\n    local self = setmetatable({}, ${1:$(capitalize yas-text)}.mt)\n    $0\n    return self\nend\n\nreturn ${1:$(capitalize yas-text)}"</span> <span class="org-string">"class"</span>)

     <span class="org-comment-delimiter">;; </span><span class="org-comment">For loop
</span>     (<span class="org-string">"for"</span> <span class="org-string">"for ${1:i} = ${2:1}, ${3:10} do\n    $0\nend"</span> <span class="org-string">"for loop"</span>)

     <span class="org-comment-delimiter">;; </span><span class="org-comment">For in loop
</span>     (<span class="org-string">"fori"</span> <span class="org-string">"for ${1:k}, ${2:v} in ${3:pairs}(${4:table}) do\n    $0\nend"</span> <span class="org-string">"for in loop"</span>)

     <span class="org-comment-delimiter">;; </span><span class="org-comment">Require
</span>     (<span class="org-string">"req"</span> <span class="org-string">"local ${1:module} = require('</span><span class="org-string"><span class="org-constant">${2:module}</span></span><span class="org-string">')"</span> <span class="org-string">"require"</span>))))
</pre>
</div>
</div>
</div>
