content/emacs/configs/programming/05-lua.org
* Keybindings Summary

| Keybinding | Function                 | Description                |
|------------+--------------------------+----------------------------|
| =C-c C-d=    | lua-search-documentation | Search Lua documentation   |
| =C-c C-r=    | lua-send-region          | Send region to Lua REPL    |
| =C-c C-l=    | lua-send-buffer          | Send entire buffer to REPL |
| =C-c C-c=    | lua-send-current-line    | Send current line to REPL  |
| =C-c C-z=    | my/lua-start-repl        | Start/switch to Lua REPL   |
| =C-c C-f=    | lua-stylua-buffer        | Format buffer with stylua  |

* Installation Requirements

To get the most out of this configuration, install:

1. **lua-language-server**: For LSP support
   #+begin_src bash :tangle no
   # macOS with Homebrew
   brew install lua-language-server
   
   # Or build from source
   git clone https://github.com/sumneko/lua-language-server
   cd lua-language-server
   git submodule update --init --recursive
   cd 3rd/luamake
   ./compile.sh
   cd ../..
   ./3rd/luamake/luamake rebuild
   #+end_src

2. **stylua**: For code formatting
   #+begin_src bash :tangle no
   # Using cargo
   cargo install stylua
   
   # Or download binary from GitHub releases
   #+end_src

3. **Love2D** (optional): For game development
   #+begin_src bash :tangle no
   # macOS
   brew install --cask love
   
   # Linux
   sudo apt install love
   #+end_src

* End of Configuration

#+begin_src emacs-lisp
(provide 'prog-lua-conf)
;;; prog-lua-conf.el ends here
#+end_src
