emacs/configs/programming/05-lua.html

<div id="outline-container-orgdfd0d16" class="outline-2">
<h2 id="orgdfd0d16"><span class="section-number-2">9.</span> Keybindings Summary</h2>
<div class="outline-text-2" id="text-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-c C-d</code></td>
<td class="org-left">lua-search-documentation</td>
<td class="org-left">Search Lua documentation</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-r</code></td>
<td class="org-left">lua-send-region</td>
<td class="org-left">Send region to Lua REPL</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-l</code></td>
<td class="org-left">lua-send-buffer</td>
<td class="org-left">Send entire buffer to REPL</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-c</code></td>
<td class="org-left">lua-send-current-line</td>
<td class="org-left">Send current line to REPL</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-z</code></td>
<td class="org-left">my/lua-start-repl</td>
<td class="org-left">Start/switch to Lua REPL</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-f</code></td>
<td class="org-left">lua-stylua-buffer</td>
<td class="org-left">Format buffer with stylua</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org14c8b10" class="outline-2">
<h2 id="org14c8b10"><span class="section-number-2">10.</span> Installation Requirements</h2>
<div class="outline-text-2" id="text-10">
<p>
To get the most out of this configuration, install:
</p>

<ol class="org-ol">
<li><p>
<b><b>lua-language-server</b></b>: For LSP support
</p>
<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter"># </span><span class="org-comment">macOS with Homebrew
</span>brew install lua-language-server

<span class="org-comment-delimiter"># </span><span class="org-comment">Or build from source
</span>git clone https://github.com/sumneko/lua-language-server
<span class="org-builtin">cd</span> lua-language-server
git submodule update --init --recursive
<span class="org-builtin">cd</span> 3rd/luamake
./compile.sh
<span class="org-builtin">cd</span> ../..
./3rd/luamake/luamake rebuild
</pre>
</div></li>

<li><p>
<b><b>stylua</b></b>: For code formatting
</p>
<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter"># </span><span class="org-comment">Using cargo
</span>cargo install stylua

<span class="org-comment-delimiter"># </span><span class="org-comment">Or download binary from GitHub releases</span>
</pre>
</div></li>

<li><p>
<b><b>Love2D</b></b> (optional): For game development
</p>
<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter"># </span><span class="org-comment">macOS
</span>brew install --cask love

<span class="org-comment-delimiter"># </span><span class="org-comment">Linux
</span>sudo apt install love
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-orgb03989f" class="outline-2">
<h2 id="orgb03989f"><span class="section-number-2">11.</span> End of Configuration</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">prog-lua-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">prog-lua-conf.el ends here</span>
</pre>
</div>
</div>
</div>
</main>
<footer id="postamble" class="status">
<p class="date">Date: 2025-12-01</p>
</footer>
</body>
</html>
